Revit 2026 API

# ToggleButtonData Methods

---

The ToggleButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ItemData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetContextualHelp | Gets the contextual help bound with this control.(Inherited from RibbonItemData) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button data.(Inherited from RibbonItemData) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ToggleButtonData Class

Autodesk.Revit.UI Namespace